notes/using-org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org mode</title>
<!-- 2019-03-01 Fri 20:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ninad Khargonkar" />
<link rel="stylesheet" type="text/css" href="css/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Org mode</h1>
<p>
<a href="../index.html">home</a> | <a href="../notes.html">notes</a> | <a href="../misc.html">misc</a>
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Orgmode and emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
The official emacs tutorial is a good place to pick up the basics. Then 
start writing down journal entires using org mode &#x2013;&gt; profit! 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Vim and tmux</h2>
<div class="outline-text-2" id="text-2">
<p>
A very good resource for taking up vim is vimtutor which can accessed in a
terminal and comes with vim.
For customizing vim, edit the .vimrc file in the home directory. Some useful
links for vim:
</p>

<ul class="org-ul">
<li>[vim cheatsheet](<a href="http://www.viemu.com/a_vi_vim_graphical_cheat_sheet_tutorial.html">http://www.viemu.com/a_vi_vim_graphical_cheat_sheet_tutorial.html</a>)
</li>

<li>[vimrc guide](<a href="https://dougblack.io/words/a-good-vimrc.html">https://dougblack.io/words/a-good-vimrc.html</a>)
</li>
</ul>

<p>
Since vim is terminal based, a terminal multiplexer like 
[tmux](<a href="https://github.com/tmux/tmux/wiki">https://github.com/tmux/tmux/wiki</a>)
helps a lot while programming with vim since multiple terminal tabs can be problematic. 
I found this
[guide](<a href="http://www.hamvocke.com/blog/a-quick-and-easy-guide-to-tmux/">http://www.hamvocke.com/blog/a-quick-and-easy-guide-to-tmux/</a>) 
to tmux 
quite good. There is also a [book](<a href="https://leanpub.com/the-tao-of-tmux/read">https://leanpub.com/the-tao-of-tmux/read</a>) for
 tmux!
</p>


<p>
Noting down some useful vim keystrokes:
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Navigation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
h &#x2013; go left
</p>

<p>
j &#x2013; go down
</p>

<p>
k &#x2013; go up
</p>

<p>
l &#x2013; go 
</p>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Saving files</h3>
<div class="outline-text-3" id="text-2-2">
<p>
:w &#x2013; write (save) the file
</p>

<p>
:wq &#x2013; write and quit
</p>

<p>
:q! &#x2013; force quit
</p>

<p>
i &#x2013; Will enable the insert mode for editing files
</p>

<p>
ESC &#x2013; Will exit inset mode (and go back to normal mode)
</p>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Operators</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Operators can be combined with the motion keys to produce different kinds of 
commands. You can guess what the motion keys are from the commands below.
Add a number in between to repeat the command.
</p>

<p>
de &#x2013; delete upto end of word (d stands for delete)
</p>

<p>
dd &#x2013; delete the whole line (kind of like CUT)
</p>

<p>
d0 &#x2013; delete upto start of line
</p>

<p>
d$ &#x2013; delete upto end of line
</p>

<p>
A &#x2013; append at the end of sentence
</p>

<p>
ce &#x2013; change until end of word
</p>

<p>
x &#x2013; acts as a delete key in insert mode
</p>

<p>
r &#x2013; replace key
</p>

<p>
p &#x2013; put prev deleted text after cursor
</p>
</div>


<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">Undo</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
u &#x2013; undo the previous command
</p>

<p>
U &#x2013; fix the whole line as it was
</p>

<p>
&lt;Ctrl-R\&gt; &#x2013; undo the undos
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Tmux</h2>
<div class="outline-text-2" id="text-3">
<p>
In this note `C` refers to the command prefix. Default is `Ctrl-b` and
in my .tmux.conf I have it as `Ctrl-a` along with mapping `CAPS` key to `Ctrl`.
</p>
</div>


<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Panes</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Split vertically: `C %`
</li>

<li>Split horizontally: `C "`
</li>

<li>Navigation: `C arrowKey`
</li>

<li>Close pane: `exit` or `Ctrl-D`
</li>

<li>Makes a pane go full screen: `C z`
</li>

<li>Resize pane in arrowKey dirn: `C-b C-arrowKey`. Here `C` refers to `Ctrl` and
</li>
</ul>
<p>
not the prefix command which is stated explicitly.
</p>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Windows (they are like Virtual Desktops)</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Create new: `C c`
</li>

<li>Switch to previous: `C p`
</li>

<li>Switch to window `NUM`: `C NUM`. (numbering starts from 0)
</li>

<li>Rename current window: `C ,`
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Session handling</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Detach current session: `C d`
</li>

<li>Choices for detaching: `C D`
</li>

<li>List sessions: `tmux ls`
</li>

<li>Attach session number 0: `tmux attach -t 0`
</li>

<li>Create session with name: `tmux new -s sessName`
</li>

<li>Rename session: `tmux rename-session -t 0 sessName`
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Created with the help of <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10). Timestamp: 2019-03-01 Fri 20:16 </p>
</div>
</body>
</html>
